Revit 2024 API
JournalingMode Enumeration
 All journaling modes supported by Revit external commands.
Namespace: Autodesk.Revit.Attributes
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public enum JournalingMode
Visual Basic
Public Enumeration JournalingMode
Visual C++
public enum class JournalingMode
Members
Member name | Description
UsingCommandData |  Uses the "StringStringMap" supplied in the command data. Hides all Revit journal entries in between the external command invocation and the StringStringMap entry. Commands which invoke the Revit UI for selection or for responses to task dialogs may not replay correctly.
NoCommandData |  Does not write contents of the ExternalCommandData.Data map to the Revit journal. But does allow Revit API calls to write to the journal as needed. This option should allow commands which invoke the Revit UI for selection or for responses to task dialogs to replay correctly.
See Also
Autodesk.Revit.Attributes Namespace